// Loader
$(window).on('load', function(){
  setTimeout(function(){
    $('.loader').fadeOut();
  }, 1500)
})

// Characters
var pics = ["bellatrix.jpg", "dobby.jpg", "draco.jpg", "dudley.jpg", "dumbledore.jpg", "fred.png", "ginny.jpg", "hagrid.png", "harry.jpg", "hermione.jpg", "luna.jpeg", "lupin.jpg", "madeye.png", "mcgonagall.jpg", "molly.jpg", "arthur.jpg", "myrtle.jpg", "neville.jpg", "petunia.jpg", "ron.jpg", "snape.jpg", "vernon.jpg", "voldemort.jpg", "sirius.jpg", "fatlady.png"];
pics = ["اِخْتَلَفَ", "اِتَّبَعَ", "اِتَّخَذَ", "اِنْتَهَى", "اِنْقَلَبَ", "اِسْتَعْجَلَ", "اِسْتَغْفَرَ", "يَسْتَكْبِرُ"];
pics = ["بَدَّلَ", "بَشَّرَ", "بَيَّنَ", "زَيَّنَ", "سَبَّحَ", "سَخَّرَ", "صَدَّقَ", "عَذَّبَ", "عَلَّمَ", "قَدَّمَ", "كَذَّبَ", "نَبَّأَ", "نَزَّلَ", "نَجَّى", "وَلَّى", "جَاهَدَ", "قَاتَلَ", "نَادَى", "نَافَقَ", "هَاجَرَ", "أَبْصَرَ", "أَحْسَنَ", "أَخْرَجَ", "أَدْخَلَ", "أَرْجَعَ", "أَرْسَلَ", "أَسْرَفَ", "أَسْلَمَ", "أَشْرَكَ", "أَصْبَحَ", "أَصْلَحَ", "أَعْرَضَ", "أَغْرَقَ", "أَفْسَدَ", "أَفْلَحَ", "أَنْبَتَ", "أَنْذَرَ", "أَنْزَلَ", "أَنْشَأَ", "أَنْعَمَ", "أَنْفَقَ", "أَنْكَرَ", "أَهْلَكَ", "أَتَمَّ", "أَحَبَّ", "أَحَلَّ", "أَسَرَّ", "أَضَلَّ", "أَعَدَّ", "أَذَاقَ", "أَرَادَ", "أَصَابَ", "أَطَاعَ", "أَقَامَ", "أَمَاتَ", "أَحْيَا", "أَخْفَى", "أَرَى", "أَغْنَى", "أَلْقَى", "أَنْجَى", "أَوْحَى", "أَوْفَى", "مَنَ", " تَى", "ذَى", "تَفَكَّرَ", "تَذَكَّرَ", "تَوَكَّلَ", "تَبَيَّنَ", "تَرَبَّصَ", "تَوَلَّى", "تَوَفَّى", "تَبَارَكَ", "تَسَاءَلَ", "اِخْتَلَفَ", "اِتَّبَعَ", "اِتَّخَذَ", "اِتَّقَى", "اِفْتَرَى", "اِهْتَدَى", "اِبْتَغَى", "اِنْتَهَى", "اِنْقَلَبَ", "اِبْيَضَّ", "اِسْوَدَّ", "اِسْتَعْجَلَ", "اِسْتَغْفَرَ", "اِسْتَكْبَرَ", "اِسْتَهْزَأَ", "اِسْتَجَابَ", "اِسْتَطَاعَ", "اِسْتَقَامَ"];

// shuffled
pics = ["أَضَلَّ", "تَوَفَّى", "بَيَّنَ", "اِخْتَلَفَ", "تَبَارَكَ", "أَنْعَمَ", "نَادَى", "ذَى", "أَذَاقَ", "أَصْلَحَ", "تَوَلَّى", "هَاجَرَ", "اِتَّخَذَ", "تَفَكَّرَ", "اِسْتَجَابَ", "زَيَّنَ", "أَسَرَّ", "أَنْزَلَ", "جَاهَدَ", "اِسْوَدَّ", "اِفْتَرَى", "أَبْصَرَ", "اِبْيَضَّ", "أَنْبَتَ", "أَرْسَلَ", "تَبَيَّنَ", "أَدْخَلَ", "أَغْنَى", "أَسْلَمَ", "اِسْتَقَامَ", "أَوْفَى", "أَطَاعَ", "سَبَّحَ", "اِنْقَلَبَ", "تَذَكَّرَ", "اِسْتَطَاعَ", "عَلَّمَ", " تَى", "كَذَّبَ", "أَسْرَفَ", "اِسْتَكْبَرَ", "قَاتَلَ", "أَغْرَقَ", "أَصْبَحَ", "سَخَّرَ", "عَذَّبَ", "أَنْشَأَ", "اِسْتَعْجَلَ", "أَخْرَجَ", "أَنْجَى", "أَحَبَّ", "اِهْتَدَى", "أَنْذَرَ", "أَحَلَّ", "أَصَابَ", "قَدَّمَ", "أَرْجَعَ", "نَبَّأَ", "أَفْسَدَ", "نَزَّلَ", "اِتَّقَى", "اِسْتَغْفَرَ", "أَرَى", "اِبْتَغَى", "صَدَّقَ", "أَحْيَا", "أَعَدَّ", "أَتَمَّ", "أَلْقَى", "نَافَقَ", "أَفْلَحَ", "بَدَّلَ", "أَشْرَكَ", "أَحْسَنَ", "أَرَادَ", "تَرَبَّصَ", "تَسَاءَلَ", "مَنَ", "نَجَّى", "أَعْرَضَ", "أَخْفَى", "وَلَّى", "أَمَاتَ", "تَوَكَّلَ", "بَشَّرَ", "اِتَّبَعَ", "أَقَامَ", "أَهْلَكَ", "اِسْتَهْزَأَ", "أَنْكَرَ", "أَوْحَى", "اِنْتَهَى", "أَنْفَقَ"];

pics = pics.slice(0, 20)


//My Guess Who Character
function myCharacter(){
  var myPic = Math.floor(Math.random() * pics.length);

  $("#me").html('<div class=card><div class="ztext me">'+ pics[myPic] + '</div><Ximg src="img/' + pics[myPic] + ' "></div>');

  var name = pics[myPic]; ///.substr(0, pics[myPic].lastIndexOf("."))
  ///name = name.charAt(0).toUpperCase() + name.slice(1);
  $("#name").html('Your word is ' + name);
}

myCharacter();


//Game Board
function shuffle() {
  pics.sort(function(a, b){return 0.5 - Math.random()});
  for (var i = 0; i < pics.length; i++) {
    $("#gameboard").append('<div class="card"><div class=ztext>' + pics[i] + '</div><Ximg src="img/' + pics[i] + '" alt="' + pics[i] + '"></div>');
  }
}

shuffle();

$("#gameboard").on('click', '.card', function(){
  $(this).toggleClass("flipped");
});

// Game Tracker
var win = 0;
var loss = 0;

$('#score').html(win + ' - ' + loss);

function updateScore(win, loss) {
  $('#score').html(win + ' - ' + loss);
}


$('#win').click(function(){
  win+=1;
  updateScore(win, loss);
  reset();
})

$('#loss').click(function(){
  loss+=1;
  updateScore(win, loss);
  reset();
})

// Reset Game Board

function reset(){
  var play = confirm('Do you want to play again?');
  if (play == true){
    $('#gameboard').html('');
    myCharacter();
    shuffle();
  } else {
    alert('Thanks for playing!');
  }
}
